Repository: CofficLab/GitOK
Catalog: Packages/PluginCommitToast/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: A confirmation toast renders at the top of the window.
zh_hans: 确认 toast 渲染在窗口顶部。
zh_hk: 確認 toast 渲染在窗口頂部。

source: A short confirmation appears right after each commit.
zh_hans: 每次提交后立即出现简短确认。
zh_hk: 每次提交後立即出現簡短確認。

source: Act or ignore
zh_hans: 操作或忽略
zh_hk: 操作或忽略

source: Actionable
zh_hans: 可操作
zh_hk: 可操作

source: Commit selected
zh_hans: 已选择提交
zh_hk: 已選擇提交

source: Commit selection cleared
zh_hans: 已清除提交选择
zh_hk: 已清除提交選擇

source: Commit succeeds
zh_hans: 提交成功
zh_hk: 提交成功

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Every commit confirmed the moment it lands.
zh_hans: 每次提交落地即获确认。
zh_hk: 每次提交落地即獲確認。

source: How It Works
zh_hans: 工作原理
zh_hk: 工作原理

source: Instant
zh_hans: 即时
zh_hk: 即時

source: Instant Feedback
zh_hans: 即时反馈
zh_hk: 即時反饋

source: Non-blocking
zh_hans: 不阻塞
zh_hk: 不阻塞

source: Quick Undo
zh_hans: 快速撤销
zh_hk: 快速撤銷

source: Roll back the last commit directly from the toast.
zh_hans: 直接从 toast 撤销上一次提交。
zh_hk: 直接從 toast 撤銷上一次提交。

source: Show toast
zh_hans: 显示 toast
zh_hk: 顯示 toast

source: Stay Out of the Way
zh_hans: 不打扰
zh_hk: 不打擾

source: The commit service reports success.
zh_hans: 提交服务报告成功。
zh_hk: 提交服務報告成功。

source: Toasts auto-dismiss and never block your workflow.
zh_hans: toast 自动消失，绝不阻塞工作流。
zh_hk: toast 自動消失，絕不阻塞工作流。

source: Undo from the toast, or let it fade away.
zh_hans: 从 toast 撤销，或任其淡出。
zh_hk: 從 toast 撤銷，或任其淡出。

source: interruptions
zh_hans: 打扰次数
zh_hk: 打擾次數

source: toast per commit
zh_hans: 每次提交一条 toast
zh_hk: 每次提交一條 toast
